# StructuralSectionGeneralS Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralS Class
Members See Also
---
Defines parameters for Round Bar structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class StructuralSectionGeneralS : StructuralSectionRound
```

Visual Basic
---
```text
Public Class StructuralSectionGeneralS _
	Inherits StructuralSectionRound
```

Visual C++
---
```text
public ref class StructuralSectionGeneralS : public StructuralSectionRound
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRound Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralS Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRoundBar
# See Also
StructuralSectionGeneralS Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace